import pandas as pd

print('----'*30)
print('Табель учащихся в средней школе # 1285')

stud_card = {
        'ID': ['01','02','03','04','05'],
        'Имя' : ['Иван','Сергей','Петр','Василий','Гиви'],
        'Фамилия': ['Иванов','Сергеев','Петров','Васильев','Аванисян'],
        'Дата рождения' : ['01.01.2000','02.02.2001','03.02.1999','04.04.2002','05.03.2001'],
        'Успеваемость' : ['Хорошист','Отличник','Хорошист','Отличник','Хорошист']
}
    
sc = pd.DataFrame(data = stud_card)

with open('students.csv', 'a', encoding='UTF-8') as cl:
        cl.write(f'{sc}')
        cl.write('\n')
    
print(sc)

print('----'*30)
print('Информация о классах')

class_card = {
        'Предмет': ['Русский язык','Математика','Физика','Биология','Информатика'],
        'Номер парты' : ['1','2','3','4','5'],
        'Ряд': ['Первый ряд','Второй ряд','Третий ряд','Четвертый ряд','Пятый ряд'],
        'Вид парты' : ['Двуместная','Двуместная','Двуместная ','Двуместная ','Одноместная'],
        'ID' : ['01','02','03','04','05']
}
    
cc = pd.DataFrame(data = class_card)

with open('cabinet.csv', 'a', encoding='UTF-8') as cl:
        cl.write(f'{cc}')
        cl.write('\n')
    
print(cc)
